{
  "POST /api/v1/auth/otp/start": "Starts OTP-only auth using email or phone; creates a minimal user if needed and sends OTP (DEV: OTP step is bypassed). Returns userId for the next step. Auth: None.",
  "POST /api/v1/auth/otp/verify": "Verifies OTP and issues access/refresh tokens (web sets refresh cookie; mobile returns refresh in body). DEV: OTP check bypassed; access token lasts ~3 days. Initializes wallets/balances on first login. Auth: None.",
  "POST /api/v1/auth/kyc/bio": "Saves KYC bio data (title, fullName, DOB, email, password) and links it to the user's KYC record; enforces email uniqueness. Auth: None.",
  "POST /api/v1/auth/verify/email": "Confirms a user's email with 6‑digit OTP. Auth: None.",
  "POST /api/v1/auth/send/phone": "Sends a phone verification OTP via SMS. Auth: None. Rate limit: 3/2min per userId.",
  "POST /api/v1/auth/verify/phone": "Verifies a user's phone with 6‑digit OTP. Auth: None.",
  "POST /api/v1/auth/edit-phone": "Updates phone number before verification completes. Auth: None.",
  "POST /api/v1/auth/kyc/document": "Uploads document proof (multipart/form-data) and stores it on the user's KYC record. Auth: None.",
  "POST /api/v1/auth/kyc/face": "Uploads facial proof (multipart/form-data) and stores it on the user's KYC record. Auth: None.",
  "POST /api/v1/auth/kyc/address": "Saves the user's full address for KYC; blocked if already verified. Auth: None.",
  "POST /api/v1/auth/kyc/consent": "Uploads consent proof (multipart/form-data) with optional text. Auth: None.",
  "POST /api/v1/auth/kyc/submit": "Submits accumulated KYC proofs to Shufti Pro and marks status pending; may return 202 while awaiting provider. Auth: None.",
  "GET /api/v1/auth/kyc/status": "Returns latest KYC status; fetches from provider when a reference exists and may auto-resubmit if reference is invalid. Auth: None.",
  "POST /api/v1/auth/request-password-reset": "Sends a short OTP to email or phone to initiate password reset. Auth: None. Rate limit: 1/2min per email/phone.",
  "POST /api/v1/auth/validate-password-reset-otp": "Validates the password reset OTP and permits setting a new password. Auth: None.",
  "POST /api/v1/auth/set-password": "Sets a new password after OTP validation; rejects reusing the current password. Auth: None.",
  "POST /api/v1/auth/refresh-token": "Exchanges a valid refresh token for a new access (and refresh) token. Web sets cookie; mobile returns both in body. Auth: None.",
  "POST /api/v1/auth/logout": "Logs out the authenticated user by clearing stored refresh tokens (and cookie for web). Auth: User Bearer.",

  "GET /api/v1/users/profile": "Returns the authenticated user's profile (minus password hash). Auth: User Bearer.",
  "PUT /api/v1/users/profile": "Partially updates profile fields like title, fullName, DOB, and phone. Auth: User Bearer.",
  "GET /api/v1/users/transactions": "Lists the user's transactions filtered by assetSymbol or contractAddress with paging and optional type/status. Auth: User Bearer.",
  "POST /api/v1/users/request-password-change": "Sends an OTP to the specified email to confirm password change for a logged-in user. Auth: User Bearer.",
  "POST /api/v1/users/validate-password-change-otp": "Validates the password-change OTP to allow updating the password. Auth: User Bearer.",
  "POST /api/v1/users/update-password-change": "Updates the password after validation; disallows reusing the old password. Auth: User Bearer.",
  "POST /api/v1/users/request-email-change": "Sends a verification OTP to the new email address to confirm email change. Auth: User Bearer.",
  "POST /api/v1/users/validate-email-change-otp": "Validates the email-change OTP before committing the new email. Auth: User Bearer.",
  "POST /api/v1/users/update-email-change": "Updates the user's email after OTP validation. Auth: User Bearer.",

  "GET /api/v1/wallets": "Lists all wallets owned by the authenticated user. Auth: User Bearer.",
  "GET /api/v1/wallets/:id": "Returns wallet details by ID if belonging to the user. Auth: User Bearer.",
  "GET /api/v1/wallets/address/:walletAddress": "Finds a wallet by its on-chain address. Auth: User Bearer.",
  "POST /api/v1/wallets": "Creates a new wallet for the specified asset symbol if not already present. Auth: User Bearer.",

  "POST /api/v1/lending/quotes": "Returns a borrow quote including required collateral, LTV, monthly interest, and origination fee; borrowNetwork ETH/TRON. Auth: User Bearer.",
  "POST /api/v1/lending/loans/from-quote": "Creates a loan from a quote, allocates a collateral receiving address, and sets status PENDING_COLLATERAL. DEV simulate can auto-activate/disburse. Auth: User Bearer.",
  "GET /api/v1/lending/loans": "Lists loans for the user with optional status/page/limit; includes current/origination USD rates. Auth: User Bearer.",
  "GET /api/v1/lending/loans/:id": "Returns a loan by ID enriched with current and origination USD rates. Auth: User Bearer.",
  "POST /api/v1/lending/loans/:id/cancel": "Cancels a loan that is still PENDING_COLLATERAL. Auth: User Bearer.",
  "POST /api/v1/lending/loans/:id/collateral/increase": "Increases collateral via INTERNAL balance or EXTERNAL on-chain; PROD may relocate to liquidity wallet. Auth: User Bearer.",
  "POST /api/v1/lending/loans/:id/repay/otp": "Requests a repayment OTP via SMS (PROD only); DEV skips OTP. Auth: User Bearer.",
  "POST /api/v1/lending/loans/:id/repay/confirm": "Confirms repayment via INTERNAL or EXTERNAL (PROD requires OTP and txHash). Updates loan status on full repayment. Auth: User Bearer.",
  "POST /api/v1/lending/loans": "Deprecated legacy direct-loan creation; returns 410. Auth: User Bearer.",
  "POST /api/v1/lending/loans/:id/repay": "Legacy single-step balance repayment; prefer new two-step flow. Auth: User Bearer.",

  "POST /api/v1/savings": "Opens a term savings account (7/30/180/365 days) with APY by account type; funds lock until term end. Auth: User Bearer.",
  "POST /api/v1/savings/:id/unsave": "Closes a savings account and credits principal (plus any accrued monthly payouts already applied). Auth: User Bearer.",
  "POST /api/v1/savings/:id/deposit": "Disabled: returns 400; deposits not supported under current spec. Auth: User Bearer.",
  "POST /api/v1/savings/:id/withdraw": "Disabled: returns 403; withdrawals replaced by unsave at term end. Auth: User Bearer.",
  "GET /api/v1/savings": "Lists all savings accounts for the user. Auth: User Bearer.",
  "GET /api/v1/savings/asset/:id": "Gets the active savings account for a given asset (or latest legacy record). Auth: User Bearer.",
  "GET /api/v1/savings/asset/:id/history": "Lists monthly earnings for a savings asset between optional dates with USD amounts. Auth: User Bearer.",

  "POST /api/v1/exchange/quote": "Estimates a swap using USD parity and split fees; returns net amount to receive. Auth: User Bearer.",
  "GET /api/v1/exchange/price-change": "Returns 24h percent change for from/to symbols via CoinMarketCap; requires CMC_API_KEY. Auth: User Bearer.",
  "POST /api/v1/exchange/swap": "Performs atomic swap between listed assets, debiting source (with fee) and crediting destination net; checks platform liquidity. Auth: User Bearer.",
  "POST /api/v1/exchange/vote": "Records a user vote for listing a coin. Auth: User Bearer.",

  "POST /api/v1/notifications": "Sends a demo notification via email/SMS to the authenticated user and records it. Auth: User Bearer.",

  "POST /api/v1/admin/auth/register": "Registers a new admin and initializes liquidity wallet system; DEV auto-verifies email/phone. Auth: None.",
  "POST /api/v1/admin/auth/send-phone-otp": "Sends phone verification OTP to an admin. Auth: None.",
  "POST /api/v1/admin/auth/verify-phone-otp": "Verifies admin phone with OTP (DEV bypass). Auth: None.",
  "POST /api/v1/admin/auth/login": "Starts admin login; PROD emails an OTP, DEV issues tokens immediately. Auth: None.",
  "POST /api/v1/admin/auth/verify-login": "Verifies admin login OTP and issues tokens (refresh cookie for web). Auth: None.",
  "POST /api/v1/admin/auth/logout": "Revokes the provided refresh token. Auth: None.",

  "GET /api/v1/admin/profile": "Returns the authenticated admin profile. Auth: Admin Bearer.",
  "PUT /api/v1/admin/profile/avatar": "Uploads an admin avatar image (multipart/form-data, max ~3MB). Auth: Admin Bearer.",
  "DELETE /api/v1/admin/profile/avatar": "Removes the admin's avatar. Auth: Admin Bearer.",
  "POST /api/v1/admin/users/block": "Blocks a user by email or phone; sets account BLOCKED and clears refresh tokens. Auth: Admin Bearer.",
  "POST /api/v1/admin/users/unblock": "Unblocks a user and restores ACTIVE status. Auth: Admin Bearer.",
  "GET /api/v1/admin/users/blocked": "Lists blocked users with pagination. Auth: Admin Bearer.",
  "GET /api/v1/admin/kyc": "Lists users with their KYC records/statuses, paginated. Auth: Admin Bearer.",
  "GET /api/v1/admin/settings": "Returns global system settings like savings APY. Auth: Admin Bearer.",
  "PUT /api/v1/admin/settings/savings-apy": "Updates the global savings APY value. Auth: Admin Bearer.",
  "POST /api/v1/admin/invite": "Sends an admin invitation email; SUPER_ADMIN only. Auth: Admin Bearer (role required).",
  "GET /api/v1/admin/users": "Lists users. Auth: Admin Bearer.",
  "GET /api/v1/admin/loans": "Lists loans. Auth: Admin Bearer.",
  "GET /api/v1/admin/savings": "Lists savings accounts. Auth: Admin Bearer.",
  "GET /api/v1/admin/transactions": "Lists transactions. Auth: Admin Bearer.",

  "POST /api/v1/admin/assets": "Creates a new asset (native or token) with per-account fees; rejects duplicates per network. Auth: Admin Bearer.",
  "GET /api/v1/admin/assets": "Lists assets with filters and pagination. Auth: Admin Bearer.",
  "GET /api/v1/admin/assets/overview": "Lists assets with reduced fields for overview. Auth: Admin Bearer.",
  "GET /api/v1/admin/assets/:id": "Returns a single asset. Auth: Admin Bearer.",
  "GET /api/v1/admin/assets/:id/fees": "Returns fee configuration for an asset. Auth: Admin Bearer.",
  "PUT /api/v1/admin/assets/:id": "Updates asset fields including fees/status; maps legacy fee fields if present. Auth: Admin Bearer.",
  "PUT /api/v1/admin/assets/:id/fees": "Updates only the asset's fees using partial per-account structures. Auth: Admin Bearer.",
  "POST /api/v1/admin/assets/:id/list": "Sets asset status to LISTED. Auth: Admin Bearer.",
  "POST /api/v1/admin/assets/:id/delist": "Sets asset status to DELISTED. Auth: Admin Bearer.",

  "GET /api/v1/admin/chat/messages": "Returns paginated admin chat between two admins. Auth: Admin Bearer.",
  "POST /api/v1/admin/chat/messages": "Sends a chat message and broadcasts via WebSocket. Auth: Admin Bearer.",
  "GET /api/v1/admin/chat/ws": "WebSocket endpoint for realtime admin chat (JWT via header or ?token=). Auth: Admin Bearer.",

  "POST /api/v1/webhooks/shufti/callback": "Receives KYC verification callbacks from Shufti Pro and updates user/KYC records. Auth: None.",
  "GET /api/v1/webhooks/shufti/redirect": "HTML redirect page shown to users after finishing Shufti verification. Auth: None.",
  "POST /api/v1/webhooks/tatum": "Receives Tatum deposit notifications and enqueues processing to credit balances net of fees. Auth: None.",

  "GET /api/v1/referrals": "Returns the authenticated user's referrals list. Auth: User Bearer.",
  "GET /api/v1/referrals/earnings": "Returns accumulated referral earnings for the user. Auth: User Bearer.",
  "POST /api/v1/referrals/test-email": "Sends a test referral email to the authenticated user. Auth: User Bearer.",

  "POST /api/v1/calculator": "Referral profit calculator: amount × referrals × 10%. Auth: None.",

  "GET /api/v1/prices": "Fetches public crypto prices from CoinGecko (demo). Auth: None.",

  "GET /api/v1/dashboard": "Aggregated user dashboard: loans, savings, transactions, wallet snapshot. Auth: User Bearer.",

  "GET /api/v1/balances": "Lists balances for all LISTED assets with USD prices and total USD. Auth: User Bearer.",
  "GET /api/v1/balances/:id": "Returns the user's balance for a specific asset with USD valuation. Auth: User Bearer."
}

